---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.Clear
source: html/cc452d91-1dbb-c193-2699-94322aa78e42.htm
---
# Autodesk.Revit.DB.ParameterSet.Clear Method

Removes every parameter from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```